app/controllers/sites_controller.rb

SELECT * FROM "sites" WHERE ("sites"."id" = 7)
---
  def show
    @site = Site.find(params[:id])

INSERT INTO "sites" ("name", "updated_at", "nickname", "url", "user_id", "created_at") VALUES('Green is Good', '2008-10-28 19:25:07', 'green', 'http://www.greenisgood.co.uk', 1, '2008-10-28 19:25:07')
---
  def create
    @site = Site.new(params[:site])
    @site.user = current_user
    if @site.save

SELECT * FROM "sites" WHERE ("sites"."id" = 7)
---
  def edit
    @site = Site.find(params[:id])