app/controllers/users_controller.rb

INSERT INTO "users" ("salt", "updated_at", "crypted_password", "remember_token_expires_at", "remember_token", "login", "email", "created_at") VALUES('cc82e10ad1d891e579839672f559ede88629961e', '2008-10-28 18:56:44', '89cebae5ed75357759183f3bf5d0013d9fcc8f77', NULL, NULL, 'mza', 'matt.j.wood@gmail.com', '2008-10-28 18:56:44')
---
  def create
    cookies.delete :auth_token
    # protects against session fixation attacks, wreaks havoc with
    # request forgery protection.
    # uncomment at your own risk
    # reset_session
    @user = User.new(params[:user])
    @user.save